In [3]:
import pandas as pd
import numpy as np
import backreach as br

In [27]:
# EXAMPLE

n = 3
mean_kin = 3 
kin = br.generate_and_find_closest(mean_kin, n)
m = br.generate_and_find_closest(2*n, 2**n)

In [28]:
tt1 = br.generate_random_dataframe(kin, n, m)
tt2 = br.generate_random_dataframe(kin, n, m)
tt3 = br.generate_random_dataframe(kin, n, m)

/Users/Enrico/Desktop/Boolean-Backwards-Reachability-main/backreach.py:44: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(lambda x: np.random.choice([0, 1], p=[0.5, 0.5]))
/Users/Enrico/Desktop/Boolean-Backwards-Reachability-main/backreach.py:44: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(lambda x: np.random.choice([0, 1], p=[0.5, 0.5]))
/Users/Enrico/Desktop/Boolean-Backwards-Reachability-main/backreach.py:44: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(lambda x: np.random.choice([0, 1], p=[0.5, 0.5]))

In [29]:
tt1

   1  2
0  1  1
1  1  0
2  0  0

In [30]:
tt2

   1  3
0  1  1
1  0  1
2  0  0
3  1  0

In [31]:
tt3

   2  3
0  1  1
2  1  0
3  0  1
4  0  0

In [32]:
#tt4

In [22]:
#tt5

In [23]:
#tt6

In [24]:
tt12 = br.conditions_product(tt1,tt2)
print(len(tt12))
tt12

8

   1  2  4  6
0  0  0  0  0
1  0  1  0  0
2  0  1  0  1
3  0  1  1  1
4  1  0  0  0
5  1  0  1  0
6  1  0  0  1
7  1  1  0  1

In [25]:
tt123 = br.conditions_product(tt12,tt3)
tt123

   1  2  3  4  6
0  0  0  0  0  0
1  0  1  0  0  0
2  0  1  0  0  1
3  0  1  0  1  1
4  1  0  0  0  0
5  1  0  1  0  0
6  1  0  0  1  0
7  1  0  1  1  0
8  1  0  1  0  1
9  1  1  1  0  1

In [26]:
#tt1234 = conditions_product(tt123,tt4)
#tt1234

In [170]:
#tt12345 = conditions_product(tt1234,tt5)
#tt12345

In [171]:
#tt123456 = conditions_product(tt12345,tt6)
#tt123456